       IDENTIFICATION DIVISION. 
       PROGRAM-ID. OPG-2.

       DATA DIVISION.
       WORKING-STORAGE SECTION. 
       01 KUNDE-ID     PIC X(10) VALUE SPACES.
       01 FORNAVN      PIC X(20) VALUE SPACES.
       01 EFTERNAVN    PIC X(20) VALUE SPACES.
       01 KONTO-NUMMER PIC X(20) VALUE SPACES.
       01 BALANCE      PIC 9(7)V9(2) VALUE 0.
       01 VALUTAKODE   PIC X(3) VALUE SPACES.

      *01 TESTVAL PIC X(100) VALUE SPACES.

       PROCEDURE DIVISION.
           MOVE "1234567890" TO KUNDE-ID
           MOVE "Lars" TO FORNAVN
           MOVE "Hansen" TO EFTERNAVN
           MOVE "DK12345678912345" TO KONTO-NUMMER
           MOVE 2500.75 TO BALANCE
           MOVE "DKK" TO VALUTAKODE

           DISPLAY "Kunde-ID: "    KUNDE-ID
           DISPLAY "Navn: "        FORNAVN " " EFTERNAVN
           DISPLAY "Kontonummer: " KONTO-NUMMER.
           DISPLAY "Balance: "     VALUTAKODE " " BALANCE

      *    UNSTRING FORNAVN DELIMITED BY SPACE
      *        INTO TESTVAL
      *    END-UNSTRING

      *    DISPLAY "Testval: '" TESTVAL "'".

       STOP RUN.
