        02 DATO.
            03 T-ÅR     PIC 9(4).
            03 FILLER   PIC X(1) VALUE "-".
            03 T-MÅNED  PIC 9(2).
            03 FILLER   PIC X(1) VALUE "-".
            03 T-DAG    PIC 9(2).
        02 FILLER   PIC X(1) VALUE "-".
        02 TID      PIC X(8).
        02 FILLER   PIC X(1) VALUE ".".
        02 MS       PIC 9(6).
