       02 CPR          PIC X(15).
       02 NAVN         PIC X(30).
       02 ADRESSE      PIC X(50).
       02 FØDSELSDATO  PIC X(11).
       02 KONTO-ID     PIC X(14).
       02 REG-NR       PIC X(6).
       02 BELØB        PIC Z(11).99.
       02 VALUTA       PIC X(4).
       02 TRANS-TYPE   PIC X(20).
       02 BUTIK        PIC X(20).
       02 TIDSPUNKT    PIC X(26).
       