       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TEST-A.

       DATA DIVISION.
       WORKING-STORAGE SECTION. 
       01  KUNDE-ID     PIC X(10) VALUE SPACES.
       01  FORNAVN      PIC X(20) VALUE SPACES.
       01  EFTERNAVN    PIC X(20) VALUE SPACES.

       01  KONTO-NUMMER PIC X(20) VALUE SPACES.
       01  BALANCE      PIC 9(7)V9(2) VALUE 0.
       01  VALUTAKODE   PIC X(3) VALUE SPACES.

       01  TESTVAL PIC X(100) VALUE SPACES.

       01  NAVN-TMP    PIC X(41) VALUE SPACES.

       01 BAL-2  PIC ZZZZZZ9V99 VALUE 0.


       PROCEDURE DIVISION.


      *    MOVE FUNCTION LOWER-CASE("HELLO") TO TESTVAL
      *    DISPLAY "Testval: '" TESTVAL "'"

      *    MOVE FUNCTION TRIM(FORNAVN,TRAILING) TO TESTVAL
      *    DISPLAY "Testval: '" TESTVAL "'"
      *    
           MOVE 1000250.75 TO BALANCE
           MOVE BALANCE TO BAL-2
           DISPLAY "balance: " BALANCE
           DISPLAY "bal-2: " BAL-2

           STOP RUN.
           

